# running in sync_fifo_bmc/src/
# Yosys cwd is <taskdir>/src (e.g. formal/sync_fifo_bmc/src); repo RTL is three levels up.
read_verilog -sv -DFORMAL ../../../../src/sync_fifo.v
prep -top sync_fifo
async2sync
hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
