[tasks]
bmc
cover

[options]
bmc: mode bmc
bmc: depth 48
cover: mode cover
cover: depth 72

[engines]
smtbmc

[files]
../src/sync_fifo.v

[script]
read_verilog -sv -DFORMAL sync_fifo.v
prep -top sync_fifo
async2sync
